tests/Api/Results/invoicereservation.xml

<?xml version="1.0"?>
<!--
  ~ Copyright (c) 2016 Martin Aarhof
  ~
  ~ Permission is hereby granted, free of charge, to any person obtaining a copy
  ~ of this software and associated documentation files (the "Software"), to deal
  ~ in the Software without restriction, including without limitation the rights
  ~ to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  ~ copies of the Software, and to permit persons to whom the Software is furnished
  ~ to do so, subject to the following conditions:
  ~
  ~ The above copyright notice and this permission notice shall be included in all
  ~ copies or substantial portions of the Software.
  ~
  ~ THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  ~ IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  ~ FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  ~ AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  ~ LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  ~ OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
  ~ THE SOFTWARE.
  -->

<APIResponse version="20110831">
    <Header>
        <Date>2011-10-20T11:50:09+02:00</Date>
        <Path>API/createInvoiceReservation</Path>
        <ErrorCode>0</ErrorCode>
        <ErrorMessage></ErrorMessage>
    </Header>
    <Body>
        <Result>Success</Result>
        <Transactions>
            <Transaction>
                <TransactionId>416</TransactionId>
                <PaymentId>ccc1479c-37f9-4962-8d2c-662d75117e9d</PaymentId>
                <CardStatus>NoCreditCard</CardStatus>
                <CreditCardToken />
                <CreditCardMaskedPan />
                <ThreeDSecureResult>Not_Applicable</ThreeDSecureResult>
                <LiableForChargeback>Merchant</LiableForChargeback>
                <BlacklistToken/>
                <ShopOrderId>asdf23</ShopOrderId>
                <Shop>AltaPay Test Shop</Shop>
                <Terminal>AltaPay Test Terminal</Terminal>
                <TransactionStatus>invoice_initialized</TransactionStatus>
                <ReasonCode>NONE</ReasonCode>
                <MerchantCurrency>978</MerchantCurrency>
                <MerchantCurrencyAlpha>EUR</MerchantCurrencyAlpha>
                <CardHolderCurrency>978</CardHolderCurrency>
                <CardHolderCurrencyAlpha>EUR</CardHolderCurrencyAlpha>
                <ReservedAmount>20</ReservedAmount>
                <CapturedAmount>0</CapturedAmount>
                <RefundedAmount>0</RefundedAmount>
                <RecurringDefaultAmount>0</RecurringDefaultAmount>
                <CreatedDate>2011-10-20 11:50:09</CreatedDate>
                <UpdatedDate>2011-10-20 11:50:09</UpdatedDate>
                <PaymentNature>CreditCard</PaymentNature>
                <PaymentNatureService name="TestAcquirer">
                    <SupportsRefunds>true</SupportsRefunds>
                    <SupportsRelease>true</SupportsRelease>
                    <SupportsMultipleCaptures>true</SupportsMultipleCaptures>
                    <SupportsMultipleRefunds>false</SupportsMultipleRefunds>
                </PaymentNatureService>
                <PaymentNature>Invoice</PaymentNature>
                <PaymentInfos />
                <CustomerInfo/>
                <ReconciliationIdentifiers />
            </Transaction>
        </Transactions>
    </Body>
</APIResponse>
